# OpenAreaLoadLoop Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..OpenAreaLoadLoop Property
BuiltInFailures..::..SketchFailures Class See Also
---
Area Load Sketch can't contain open loops.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OpenAreaLoadLoop { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OpenAreaLoadLoop As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OpenAreaLoadLoop {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace